Revit 2027 API
FilteredWorksetCollector.OfKind Method
 Applies a WorksetKindFilter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredWorksetCollector OfKind(
	WorksetKind worksetKind
)
Public Function OfKind (
	worksetKind As WorksetKind
) As FilteredWorksetCollector
public:
FilteredWorksetCollector^ OfKind(
	WorksetKind worksetKind
)
member OfKind :
        worksetKind : WorksetKind -> FilteredWorksetCollector
Parameters
worksetKind WorksetKind
 The WorksetKind of the workset.
Return Value
FilteredWorksetCollector
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Only worksets whose WorksetKind is an exact match to the input WorksetKind will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace